Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: ekimara
en: [GENERAL_NOUN] arrow

source: ebimara
en: [GENERAL_NOUN_PLURAL] arrows

source: ekikwato
en: [GENERAL_NOUN] household

source: ekikwasi
en: [GENERAL_NOUN] safety pin

source: ebikwasi
en: [GENERAL_NOUN_PLURAL] safety pins

source: ekikururuzo
en: [GENERAL_NOUN] **track, trail**

source: ebikururuzo
en: [GENERAL_NOUN_PLURAL] **track, trail**s

source: ekikunya
en: [GENERAL_NOUN] stump of a tree

source: ebikunya
en: [GENERAL_NOUN_PLURAL] stump of a trees

source: ekikungulima
en: [GENERAL_NOUN] a projecting thing

source: ebikungulima
en: [GENERAL_NOUN_PLURAL] projecting things

source: ekikule
en: [GENERAL_NOUN] hunting-horn

source: ebikule
en: [GENERAL_NOUN_PLURAL] hunting-horns

source: ekikugizo
en: [GENERAL_NOUN] title of honour

source: ebikugizo
en: [GENERAL_NOUN_PLURAL] title of honours

source: ekikonkonamiti
en: [GENERAL_NOUN] woodpecker

source: ebikonkonamiti
en: [GENERAL_NOUN_PLURAL] woodpeckers

source: ekikonkomago
en: [GENERAL_NOUN] wood pecker

source: ebikonkomago
en: [GENERAL_NOUN_PLURAL] wood peckers

source: ekikonkomi
en: [COMMON_ANIMALS_NOUN] large lizard

source: ebikonkomi
en: [COMMON_ANIMALS_NOUN_PLURAL] large lizards

source: ekikoonora
en: [COMMON_ANIMALS_NOUN] bull dozer

source: ebikoonora
en: [COMMON_ANIMALS_NOUN_PLURAL] bull dozers

source: ekikura
en: [GENERAL_NOUN] a large trench

source: ebikura
en: [GENERAL_NOUN_PLURAL] large trenches

source: ekinuuko
en: [GENERAL_NOUN] stench: a bad smell

source: ebinuuko
en: [GENERAL_NOUN_PLURAL] stench: a bad smells

source: ekilaaya
en: [GENERAL_NOUN] irish potato

source: ebilaaya
en: [GENERAL_NOUN_PLURAL] irish potatos

source: ekimeeri
en: [GENERAL_NOUN] friendship without blood- brotherhood

source: ebimeeri
en: [GENERAL_NOUN_PLURAL] friendship without blood- brotherhoods

source: ekinaabiro
en: [GENERAL_NOUN] bathroom

source: ebinaabiro
en: [GENERAL_NOUN_PLURAL] bathrooms

source: ekingoora
en: [COMMON_ANIMALS_NOUN] crow

source: ebingoora
en: [COMMON_ANIMALS_NOUN_PLURAL] crows

source: ekinosi
en: [GENERAL_NOUN] protuberance above navel

source: ebinosi
en: [GENERAL_NOUN_PLURAL] protuberance above navels

source: ekintu
en: [GENERAL_NOUN] a thing

source: ebintu
en: [GENERAL_NOUN_PLURAL] things

source: ekinyabaisiki
en: [GENERAL_NOUN] mushroom: an edible mushroom

source: ebinyabaisiki
en: [GENERAL_NOUN_PLURAL] mushroom: an edible mushrooms

source: ekibazo
en: [GENERAL_NOUN] sentence: a complete statement

source: ebibazo
en: [GENERAL_NOUN_PLURAL] sentence: a complete statements

source: ekibbaati
en: [GENERAL_NOUN] an old iron sheet

source: ebibbaati
en: [GENERAL_NOUN_PLURAL] old iron sheets

source: ekibbiriiti
en: [GENERAL_NOUN] a match box

source: ebibbiriiti
en: [GENERAL_NOUN_PLURAL] match boxes

source: ekibero
en: [GENERAL_NOUN] thigh, lap

source: ebibero
en: [GENERAL_NOUN_PLURAL] thigh, laps

source: ekibiriza
en: [GENERAL_NOUN] boiled meat

source: ebibiriza
en: [GENERAL_NOUN_PLURAL] boiled meats

source: ekibindi
en: [GENERAL_NOUN] clay or wooden bowl

source: ebibindi
en: [GENERAL_NOUN_PLURAL] clay or wooden bowls

source: ekibunu/ekitiri
en: [GENERAL_NOUN] buttocks

source: ebibunu/ebitiri
en: [GENERAL_NOUN_PLURAL] buttockses

source: ekibwegurra
en: [COMMON_ANIMALS_NOUN] a hairy stinging caterpillar

source: ebibwegurra
en: [COMMON_ANIMALS_NOUN_PLURAL] hairy stinging caterpillars

source: omukonko
en: [GENERAL_NOUN] sw.cereal: maize cob

source: emikonko
en: [GENERAL_NOUN_PLURAL] sw.cereal: maize cobs

source: ekicu
en: [GENERAL_NOUN] cloud

source: ebicu
en: [GENERAL_NOUN_PLURAL] clouds

source: ekibbaali
en: [CULTURE_AND_TRADITION_NOUN] spirit shrine for twins

source: ebibbaali
en: [CULTURE_AND_TRADITION_NOUN_PLURAL] spirit shrine for twinses

source: ekibiriiti
en: [GENERAL_NOUN] match box

source: ebibiriiti
en: [GENERAL_NOUN_PLURAL] match boxes

source: ekibira
en: [GENERAL_NOUN] forest

source: ebibira
en: [GENERAL_NOUN_PLURAL] forests

source: ekibonwomwe
en: [GENERAL_NOUN] a shooting star

source: ebibonwomwe
en: [GENERAL_NOUN_PLURAL] shooting stars

source: ekibunda
en: [GENERAL_NOUN] a dull rainy day

source: ebibunda
en: [GENERAL_NOUN_PLURAL] dull rainy days

source: ekibwana
en: [COMMON_ANIMALS_NOUN] puppy: a young dog

source: ebibwana
en: [COMMON_ANIMALS_NOUN_PLURAL] puppy: a young dogs

source: ekicooli
en: [GENERAL_NOUN] maize

source: ekinyangondookyera/ekitindinda
en: [GENERAL_NOUN] a snail

source: ebinyangondookyeraebitindinda
en: [GENERAL_NOUN_PLURAL] snails

source: endobeso
en: [GENERAL_NOUN] fish-trap

source: ekinyomo
en: [GENERAL_NOUN] a large brown ant

source: ebinyomo
en: [GENERAL_NOUN_PLURAL] large brown ants

source: ekinyonyi
en: [GENERAL_NOUN] bird

source: ebinyonyi
en: [GENERAL_NOUN_PLURAL] birds

source: ekinywa
en: [BIOLOGY_NOUN] vein, artery

source: ebinywa
en: [BIOLOGY_NOUN_PLURAL] vein, arteries

source: ekipampagara
en: [GENERAL_NOUN] mud guard

source: ebipampagara
en: [GENERAL_NOUN_PLURAL] mud guards

source: ekiranga
en: [GENERAL_NOUN] a broken pot

source: ebiranga
en: [GENERAL_NOUN_PLURAL] broken pots

source: ekipanga
en: [GENERAL_NOUN] panga, matchet

source: ebipanga
en: [GENERAL_NOUN_PLURAL] panga, matchets

source: ekiragaano
en: [GENERAL_NOUN] covenant, agreement

source: ebiragaano
en: [GENERAL_NOUN_PLURAL] covenant, agreements

source: ekirahuli
en: [GENERAL_NOUN] glass, tumbler

source: ebirahuli
en: [GENERAL_NOUN_PLURAL] glass, tumblers

source: ekirali
en: [GENERAL_NOUN] wild

source: ebirali
en: [GENERAL_NOUN_PLURAL] wilds

source: ekiramukyo
en: [GENERAL_NOUN] small present, remembrance

source: ebiramukyo
en: [GENERAL_NOUN_PLURAL] small present, remembrances

source: ekinyamunsungusungu
en: [COMMON_ANIMALS_NOUN] crested eagle

source: ebinyamunsungusungu
en: [COMMON_ANIMALS_NOUN_PLURAL] crested eagles

source: ekinyoobwa
en: [GENERAL_NOUN] groundnut

source: ekinyumyo
en: [GENERAL_NOUN] festivity or feast

source: ebinyumyo
en: [GENERAL_NOUN_PLURAL] festivity or feasts

source: ekinywabwino
en: [GENERAL_NOUN] blotting paper

source: ebinywabwino
en: [GENERAL_NOUN_PLURAL] blotting papers

source: ekipaali
en: [GENERAL_NOUN] papyrus mat

source: ebipaali
en: [GENERAL_NOUN_PLURAL] papyrus mats

source: ekipande
en: [GENERAL_NOUN] reading sheet, notice, card

source: ebipande
en: [GENERAL_NOUN_PLURAL] reading sheet, notice, cards

source: ekirandakwata
en: [GENERAL_NOUN] a useless person

source: ebirandakwata
en: [GENERAL_NOUN_PLURAL] useless persons

source: ekipiira
en: [GENERAL_NOUN] jerrycan

source: ebipiira
en: [GENERAL_NOUN_PLURAL] jerrycans

source: ekirabyo
en: [GENERAL_NOUN] flower, blossom

source: ebirabyo
en: [GENERAL_NOUN_PLURAL] flower, blossoms

source: ekirahiro
en: [GENERAL_NOUN] oath, vow

source: ebirahiro
en: [GENERAL_NOUN_PLURAL] oath, vows

source: ekirale
en: [GENERAL_NOUN] a trail of men

source: ebirale
en: [GENERAL_NOUN_PLURAL] trail of mens

source: ekirangirro
en: [GENERAL_NOUN] proclamation,anouncement

source: ebirangirro
en: [GENERAL_NOUN_PLURAL] proclamation,anouncements

source: ekireere
en: [GENERAL_NOUN] dry banana fibres

source: ebireere
en: [GENERAL_NOUN_PLURAL] dry banana fibreses

source: embabazi
en: [GENERAL_NOUN] sympathy,grace, kindness

source: embambagya
en: [GENERAL_NOUN] smart, clever person

source: embaraasi
en: [COMMON_ANIMALS_NOUN] horse

source: embasuko
en: [GENERAL_NOUN] spring of trap

source: embaza
en: [GENERAL_NOUN] speech, pronunciation, talking of

source: embegede emberra
en: [COMMON_ANIMALS_NOUN] fish with snout virgin

source: embogo
en: [COMMON_ANIMALS_NOUN] buffalo

source: embumbe/ekyekulingirire
en: [GENERAL_NOUN] round shaped

source: embunduguru
en: [GENERAL_NOUN] rounded or rotund object

source: emboijana
en: [GENERAL_NOUN] a friendless person

source: embomboza
en: [GENERAL_NOUN] lonely person, vagrant

source: emboni
en: [EDUCATION_AND_LEARNING_NOUN] pupil of the eye

source: embanza
en: [GENERAL_NOUN] beginning

source: embatamo
en: [GENERAL_NOUN] extended flat bums

source: embone
en: [GENERAL_NOUN] eyelids

source: embaya
en: [GENERAL_NOUN] dry papyrus stalks

source: emberenge
en: [GENERAL_NOUN] dried maize grains

source: emboyi
en: [GENERAL_NOUN] bully, tyrant

source: embumbatizi
en: [COMMON_ANIMALS_NOUN] sitting hen, broody hen

source: emburara
en: [GENERAL_NOUN] jaraguÃ¡ (Hyparrhenia rufa)

source: embwa embyara
en: [COMMON_ANIMALS_NOUN] a dog planting

source: emeeza
en: [GENERAL_NOUN] table

source: emera
en: [GENERAL_NOUN] shape, appearance

source: emigambire
en: [GENERAL_NOUN] way of speaking, pronunciation

source: embwakazi
en: [COMMON_ANIMALS_NOUN] bitch: a female dog

source: emigaatwa
en: [GENERAL_NOUN] malnourished domestic animals

source: embungu
en: [GENERAL_NOUN] a small boring beetle

source: emburabura
en: [GENERAL_NOUN] foreigner, homeless person

source: emenge
en: [GENERAL_NOUN] blaze

source: emibbwebbwe
en: [GENERAL_NOUN] half-cooked potatoes

source: emigaramo
en: [GENERAL_NOUN] idleness, leisure

source: emitego
en: [GENERAL_NOUN] bowed legs

source: embugo
en: [GENERAL_NOUN] bark cloth

source: embunda
en: [GENERAL_NOUN] a dull day

source: embuuru
en: [GENERAL_NOUN] sea: very large lake

source: embuzi
en: [COMMON_ANIMALS_NOUN] a goat or sheep

source: embyamyamu
en: [GENERAL_NOUN] a reclining chair

source: emengo
en: [GENERAL_NOUN] grinning stones

source: emerezi
en: [GENERAL_NOUN] self sown or planted

source: emicungiro
en: [GENERAL_NOUN] dirt in the nail

source: emirabanamu
en: [GENERAL_NOUN] bothersome problems

source: emilyoni ikumi
en: [GENERAL_NOUN] ten million

source: empande
en: [GENERAL_NOUN] Bambara nuts

source: emilyoni
en: [MATHEMATICS_NOUN] one billion

source: eminwa
en: [GENERAL_NOUN] lips

source: eminyeeto
en: [GENERAL_NOUN] the youth

source: emirembe emitalibaine
en: [GENERAL_NOUN] peace

source: emitalibaine
en: [GENERAL_NOUN] problems, worries, difficultie

source: emitegano
en: [GENERAL_NOUN] business, hard work

source: emirindi
en: [GENERAL_NOUN] tramping of many fee

source: emitumanyuma
en: [GENERAL_ADV] between the shoulder blades

source: emyetuno
en: [GENERAL_NOUN] showing off, affectation, vanity

source: empooza
en: [GENERAL_NOUN] taxi levied, dues, customs

source: empotole
en: [GENERAL_NOUN] undiluted sweet banana juice

source: empuka
en: [GENERAL_NOUN] east wind

source: empulirizo
en: [GENERAL_NOUN] small opening of cavity

source: encumate
en: [GENERAL_NOUN] thick eye secretions

source: encwekye
en: [GENERAL_NOUN] someone who dies childless

source: empuruuturro
en: [GENERAL_NOUN] sliding loop, noose, bow

source: empuule
en: [GENERAL_NOUN] unground millet, loose grain

source: empuunisa
en: [GENERAL_NOUN] nasal sounds

source: empwamaani
en: [GENERAL_NOUN] invalid, weak, passive person

source: empwerwa
en: [GENERAL_NOUN] utterly destitute person

source: empwite
en: [GENERAL_NOUN] very old person, senile

source: ebitanga
en: [GENERAL_NOUN] spots: small round spots

source: ebyahandiikirwe
en: [GENERAL_NOUN] scriptures: religious writings

source: ebyobutegeki
en: [POLITICS_AND_CURRENT_AFFAIRS_NOUN] politics: matters of politics

source: ebisigi
en: [GENERAL_NOUN] eyebrows

source: ebitaara
en: [GENERAL_NOUN] car head lamps

source: ebiteere
en: [GENERAL_NOUN] dried cassava

source: ebyondo
en: [GENERAL_NOUN] mud: soft sticky mud

source: eduuka
en: [GENERAL_NOUN] shop, business premise

source: efirimbi
en: [GENERAL_NOUN] whistle

source: ebitarira
en: [GENERAL_NOUN] scattered animal spots

source: eboote
en: [GENERAL_NOUN] the aged

source: ebyakwahwa
en: [GENERAL_NOUN] armpit hair

source: ebyamaka
en: [GENERAL_NOUN] family matters

source: ebyari
en: [GENERAL_NOUN] rags

source: ebya Sitaani
en: [GENERAL_NOUN] evil acts

source: ecupa
en: [GENERAL_NOUN] bottle

source: edubu
en: [GENERAL_NOUN] Sear

source: egaaju
en: [COMMON_ANIMALS_NOUN] a brown cow

source: Egiigya
en: [GENERAL_NOUN] type of loan grass

source: egomborra
en: [GENERAL_NOUN] sub-county

source: egyambiya
en: [GENERAL_NOUN] machette

source: ejoora
en: [GENERAL_NOUN] roll ofcloth

source: eka
en: [GENERAL_NOUN] a home, a homestead

source: ekambi
en: [GENERAL_NOUN] hard working

source: ekarwa
en: [NATURE_AND_ENVIRONMENT_NOUN] type of grass

source: ekelezia
en: [GENERAL_NOUN] church

source: ekibako
en: [GENERAL_NOUN] tomb

source: ebibako
en: [GENERAL_NOUN_PLURAL] tombs

source: ebibaara
en: [GENERAL_NOUN_PLURAL] ekibaaras

source: ekibanda
en: [GENERAL_NOUN] carpenter's shade

source: ebibanda
en: [GENERAL_NOUN_PLURAL] carpenter's shades

source: egaali
en: [GENERAL_NOUN] bicycle

source: egaragara
en: [COMMON_ANIMALS_NOUN] lizard

source: egi
en: [GENERAL_NOUN] which

source: egunga
en: [GENERAL_NOUN] a specie of grass

source: ego mail
en: [GENERAL_NOUN] truly

source: ehiira
en: [GENERAL_NOUN] porriedge: sour porridge

source: ekaanyuma
en: [GENERAL_NOUN] behind the house

source: ekaraamu
en: [GENERAL_NOUN] pencil, writing instrument

source: ekanisa
en: [GENERAL_NOUN] church

source: ekirimi
en: [GENERAL_NOUN] flames of fire

source: ebirimi
en: [GENERAL_NOUN_PLURAL] flames of fires

source: ekirego
en: [GENERAL_NOUN] a secret accusation

source: ekiremba
en: [GENERAL_NOUN] a head- cloth

source: ebiremba
en: [GENERAL_NOUN_PLURAL] head- cloths

source: ekiriisa
en: [GENERAL_NOUN] fertility/ nutrition

source: ebiriisa
en: [GENERAL_NOUN_PLURAL] fertility/ nutritions

source: ekirubi
en: [GENERAL_NOUN] a furnace

source: ebirubi
en: [GENERAL_NOUN_PLURAL] furnaces

source: ekirongooro
en: [GENERAL_NOUN] return present

source: ebirongooro
en: [GENERAL_NOUN_PLURAL] return presents

source: ekirungo
en: [GENERAL_NOUN] seasoning, spice

source: ekireego
en: [GENERAL_NOUN] taut string

source: ebireego
en: [GENERAL_NOUN_PLURAL] taut strings

source: ekirenge
en: [GENERAL_NOUN] hoof, foot

source: ebirenge
en: [GENERAL_NOUN_PLURAL] hoof, foots

source: ekirere
en: [GENERAL_NOUN] gourd of milk

source: ebirere
en: [GENERAL_NOUN_PLURAL] gourd of milks

source: ekirumiko
en: [GENERAL_NOUN] a vessel cupping- hoi

source: ebirumiko
en: [GENERAL_NOUN_PLURAL] vessel cupping- hois

source: ekiromba
en: [GENERAL_NOUN] i protruding navel

source: ebiromba
en: [GENERAL_NOUN_PLURAL] i protruding navels

source: ekirooto
en: [GENERAL_NOUN] a dream

source: ebirooto
en: [GENERAL_NOUN_PLURAL] dreams

source: ekirukirro
en: [GENERAL_NOUN] nickname

source: ebirukirro
en: [GENERAL_NOUN_PLURAL] nicknames

source: ekirurumo
en: [GENERAL_NOUN] a low-pitched mumbling sound

source: ebirurumo
en: [GENERAL_NOUN_PLURAL] low-pitched mumbling sounds

source: ekisaaru
en: [GENERAL_NOUN] a reedlike swamp grass

source: ebisaaru
en: [GENERAL_NOUN_PLURAL] reedlike swamp grasses

source: ekisagiko
en: [GENERAL_NOUN] ornament: hair beads

source: ebisagiko
en: [GENERAL_NOUN_PLURAL] ornament: hair beadses

source: ekisa
en: [GENERAL_NOUN] labour pain

source: ekizaaiiiro/ ekisaaru
en: [GENERAL_NOUN] swamp, stream, river

source: ebizaaiiiro/ ekisaaru
en: [GENERAL_NOUN_PLURAL] swamp, stream, rivers

source: ekisabiko
en: [GENERAL_NOUN] herbal purgative

source: ebisabiko
en: [GENERAL_NOUN_PLURAL] herbal purgatives

source: ekisanju
en: [GENERAL_NOUN] whip

source: ebisanju
en: [GENERAL_NOUN_PLURAL] whips

source: ekisasaazi
en: [GENERAL_NOUN] spark (of fire)

source: ebisasaazi
en: [GENERAL_NOUN_PLURAL] spark (of fire)s

source: ekisegu
en: [GENERAL_NOUN] sexual urge

source: ebisegu
en: [GENERAL_NOUN_PLURAL] sexual urges

source: ekisengiijo
en: [GENERAL_NOUN] filter

source: ebisengiijo
en: [GENERAL_NOUN_PLURAL] filters

source: ekisense
en: [GENERAL_NOUN] ragged edge, rag

source: ebisense
en: [GENERAL_NOUN_PLURAL] ragged edge, rags

source: ekisanku
en: [COMMON_ANIMALS_NOUN] dry cow dung

source: ebisanku
en: [COMMON_ANIMALS_NOUN_PLURAL] dry cow dungs

source: ekisensero
en: [GENERAL_NOUN] entrance: a posterior gate

source: ebisensero
en: [GENERAL_NOUN_PLURAL] entrance: a posterior gates

source: ekisinjo
en: [GENERAL_NOUN] rage: violent uncontrolled anger

source: ebisinjo
en: [GENERAL_NOUN_PLURAL] rage: violent uncontrolled angers

source: ekisore
en: [COMMON_ANIMALS_NOUN] puppy: a young dog

source: ebisore
en: [COMMON_ANIMALS_NOUN_PLURAL] puppy: a young dogs

source: ekisutama-hamwe
en: [GENERAL_NOUN] a traditional stool

source: ebisutama-hamwe
en: [GENERAL_NOUN_PLURAL] traditional stools

source: ekisaatu
en: [GENERAL_NOUN] skin, hide

source: ebisaatu
en: [GENERAL_NOUN_PLURAL] skin, hides

source: ekisago
en: [GENERAL_NOUN] a pillow,cushion

source: ebisago
en: [GENERAL_NOUN_PLURAL] pillow,cushions

source: ekisambizo ekisanuruzo
en: [COMMON_ANIMALS_NOUN] spur of cock comb

source: ebisambizo ekisanuruzo
en: [COMMON_ANIMALS_NOUN_PLURAL] spur of cock combs

source: ekisarazi
en: [GENERAL_NOUN] numbness, cramp

source: ebisarazi
en: [GENERAL_NOUN_PLURAL] numbness, cramps

source: ekisebe
en: [BIOLOGY_NOUN] beetle larva, grub

source: ebisebe
en: [BIOLOGY_NOUN_PLURAL] beetle larva, grubs

source: ekisengeijo
en: [GENERAL_NOUN] strainer

source: ebisengeijo
en: [GENERAL_NOUN_PLURAL] strainers

source: ekisamba
en: [GENERAL_NOUN] floating vegetation on water

source: ebisamba
en: [GENERAL_NOUN_PLURAL] floating vegetation on waters

source: ekisonga
en: [GENERAL_NOUN] chest pain

source: ebisonga
en: [GENERAL_NOUN_PLURAL] chest pains

source: ekisorosoro
en: [GENERAL_NOUN] navel: a big navel

source: ebisorosoro
en: [GENERAL_NOUN_PLURAL] navel: a big navels

source: ekisoma
en: [GENERAL_NOUN] fresh bean leaves

source: ebisoma
en: [GENERAL_NOUN_PLURAL] fresh bean leaveses

source: ekisurugu
en: [GENERAL_NOUN] groundnut husk

source: ebisurugu
en: [GENERAL_NOUN_PLURAL] groundnut husks

source: ekisizi
en: [GENERAL_NOUN] a plant disease

source: ebisizi
en: [GENERAL_NOUN_PLURAL] plant diseases

source: ekisyarazi
en: [GENERAL_NOUN] stagnant water

source: ebisyarazi
en: [GENERAL_NOUN_PLURAL] stagnant waters

source: ekitaba
en: [GENERAL_NOUN] ditch

source: ebitaba
en: [GENERAL_NOUN_PLURAL] ditches

source: ekitabaswa
en: [GENERAL_NOUN] a suit case

source: ebitabaswa
en: [GENERAL_NOUN_PLURAL] suit cases

source: ekitaka
en: [GENERAL_NOUN] a clod

source: ebitaka
en: [GENERAL_NOUN_PLURAL] clods

source: ekitaraariire
en: [GENERAL_NOUN] something that happens unexpectedly

source: ebitaraariire
en: [GENERAL_NOUN_PLURAL] something that happens unexpectedlies

source: ekisiika
en: [GENERAL_NOUN] partition,wall, room

source: ebisiika
en: [GENERAL_NOUN_PLURAL] partition,wall, rooms

source: ekisindikwa
en: [GENERAL_NOUN] turf, sod

source: ebisindikwa
en: [GENERAL_NOUN_PLURAL] turf, sods

source: ekisinziro
en: [GENERAL_NOUN] heel

source: ebisinziro
en: [GENERAL_NOUN_PLURAL] heels

source: ekisirya
en: [GENERAL_NOUN] calabash, gourd

source: ebisirya
en: [GENERAL_NOUN_PLURAL] calabash, gourds

source: ekisomabwire
en: [GENERAL_NOUN] a nightjar bird

source: ebisomabwire
en: [GENERAL_NOUN_PLURAL] nightjar birds

source: ekisombera
en: [GENERAL_NOUN] a very large basket

source: ebisombera
en: [GENERAL_NOUN_PLURAL] very large baskets

source: ekisonko
en: [GENERAL_NOUN] sea shell

source: ebisonko
en: [GENERAL_NOUN_PLURAL] sea shells

source: ekisoonante
en: [NATURE_AND_ENVIRONMENT_NOUN] a kind of grass

source: ebisoonante
en: [NATURE_AND_ENVIRONMENT_NOUN_PLURAL] kind of grasses

source: ekisunsuzo
en: [GENERAL_NOUN] a comb

source: ebisunsuzo
en: [GENERAL_NOUN_PLURAL] combs

source: ekisweko
en: [GENERAL_NOUN] blister

source: ebisweko
en: [GENERAL_NOUN_PLURAL] blisters

source: ekitanakya
en: [GENERAL_NOUN] emetic, makesone vomit

source: ebitanakya
en: [GENERAL_NOUN_PLURAL] emetic, makesone vomits

source: ekisire
en: [GENERAL_NOUN] obstinate person

source: ebisire
en: [GENERAL_NOUN_PLURAL] obstinate persons

source: ekisooko
en: [GENERAL_NOUN] a locally made cigarette

source: ebisooko
en: [GENERAL_NOUN_PLURAL] locally made cigarettes

source: ekitabaraara
en: [GENERAL_NOUN] the guest of honour

source: ebitabaraara
en: [GENERAL_NOUN_PLURAL] guest of honours

source: ekisiibo
en: [GENERAL_NOUN] fasting period

source: ebisiibo
en: [GENERAL_NOUN_PLURAL] fasting periods

source: ekisingolezo
en: [GENERAL_NOUN] a broom

source: ebisingolezo
en: [GENERAL_NOUN_PLURAL] brooms

source: ekisumuruzo
en: [GENERAL_NOUN] a key, an opener

source: ebisumuruzo
en: [GENERAL_NOUN_PLURAL] key, an openers

source: ekisuzi
en: [GENERAL_NOUN] wildcat, bed bug

source: ebisuzi
en: [GENERAL_NOUN_PLURAL] wildcat, bed bugs

source: ekisusu
en: [GENERAL_NOUN] peel, husk, fore skin

source: ebisusu
en: [GENERAL_NOUN_PLURAL] peel, husk, fore skins

source: ekitaatnutoole
en: [GENERAL_NOUN] nonsense

source: ebitaatnutoole
en: [GENERAL_NOUN_PLURAL] nonsenses

source: ekitabujuguta
en: [COMMON_ANIMALS_NOUN] civet-cat

source: ebitabujuguta
en: [COMMON_ANIMALS_NOUN_PLURAL] civet-cats

source: ekitakuli
en: [GENERAL_NOUN] potato

source: ekitanake
en: [GENERAL_NOUN] heap of vomit

source: ebitanake
en: [GENERAL_NOUN_PLURAL] heap of vomits

source: ekitangaazo
en: [GENERAL_NOUN] a microscope

source: ebitangaazo
en: [GENERAL_NOUN_PLURAL] microscopes

source: endyakiro
en: [COMMON_ANIMALS_NOUN] mouse

source: endyanga
en: [GENERAL_NOUN] skinbag, leather bag

source: enfuuzi
en: [GENERAL_NOUN] orphan

source: engaba
en: [GENERAL_NOUN] distribution, giving

source: engambisa
en: [GENERAL_NOUN] vowels

source: engano
en: [GENERAL_NOUN] wheat flour,wheat

source: enganja
en: [GENERAL_NOUN] white geranium

source: engurumbanyi
en: [GENERAL_NOUN] untrust-worthy person

source: endyaga
en: [GENERAL_NOUN] plenty of food

source: eenimi
en: [COMMON_ANIMALS_NOUN] bull: male cattle

source: enfaana
en: [GENERAL_NOUN] tapeworm

source: enfunjo
en: [ART_AND_ENTERTAINMENT_NOUN] papyrus for craft work

source: enfuuni
en: [GENERAL_NOUN] a worn out hoe

source: enfumbi
en: [GENERAL_NOUN] swollen glands

source: engabi
en: [GENERAL_NOUN] bushbuck

source: engabwa
en: [MILITARY_NOUN] general, commander, ambassador, representative

source: engagya
en: [COMMON_ANIMALS_NOUN] large spotted hyena

source: engamba
en: [GENERAL_NOUN] shell spoon,sea shell

source: engambo
en: [GENERAL_NOUN] dialect, speech,utterance or rumour

source: enganga
en: [GENERAL_NOUN] loan meat

source: enganjani
en: [GENERAL_NOUN] friend

source: enganyi
en: [GENERAL_NOUN] sorrow, sadness

source: engasa
en: [GENERAL_NOUN] small delicious fish

source: engazi
en: [GENERAL_NOUN] palm oil

source: engendo
en: [GENERAL_NOUN] travels, journeys

source: engenzigenzi
en: [GENERAL_NOUN] type of beetle

source: engingo
en: [GENERAL_NOUN] shape, figure, joint

source: engoga
en: [GENERAL_NOUN] open wound

source: engombe
en: [GENERAL_NOUN] hoot

source: engonero
en: [GENERAL_NOUN] secretion from the mouth

source: engonzi
en: [GENERAL_NOUN] love, affection

source: engoro
en: [GENERAL_NOUN] reed

source: engoto
en: [GENERAL_NOUN] nape of neck

source: enguha
en: [GENERAL_NOUN] tick, mite

source: engumangane
en: [GENERAL_NOUN] hard-hearted, obstinate

source: engunu
en: [GENERAL_NOUN] gum (of teeth)

source: engururrumi
en: [GENERAL_NOUN] stunted child

source: enguudo
en: [GENERAL_NOUN] high road, street

source: enguzi
en: [GENERAL_NOUN] bribe

source: enio
en: [GENERAL_NOUN] buttocks, bottom

source: enjaza
en: [GENERAL_NOUN] reedbuck

source: enjeru
en: [COMMON_ANIMALS_NOUN] white sheep, cow

source: engarukamu
en: [GENERAL_NOUN] way of answering

source: engaase
en: [GENERAL_NOUN] sundried meat

source: engenzi
en: [GENERAL_NOUN] traveller

source: engiga
en: [GENERAL_NOUN] notch, joint, point

source: engo
en: [COMMON_ANIMALS_NOUN] leopard

source: engobya
en: [GENERAL_NOUN] cunning deceitful person, cheat

source: engoma
en: [GOVERNANCE_AND_ADMINISTRATION_NOUN] drum, throne

source: engona
en: [GENERAL_NOUN] slime on stagnant water

source: engondo
en: [GENERAL_NOUN] cuts on the body

source: engonge
en: [GENERAL_NOUN] otter

source: engoonyo
en: [GENERAL_NOUN] camping-place, tennporary shelter
